package gr.aueb.cf.ch10.revisionProjects;

/**
 * Αναπτύξτε ένα πρόγραμμα σε Java που να διαβάζει από ένα αρχείο ακέραιους αριθμούς
 * (το αρχείο πρέπει να περιέχει περισσότερους από 6 αριθμούς και το πολύ 49 αριθμούς) με τιμές από 1 έως 49.
 * Τους αριθμούς αυτούς τους εισάγει σε ένα πίνακα, τον οποίο ταξινομεί (π.χ. με την Arrays.sort()).
 * Στη συνέχεια, το πρόγραμμα παράγει όλες τις δυνατές εξάδες (συνδυασμούς 6 αριθμών). Ταυτόχρονα και αμέσως μετά την παραγωγή κάθε εξάδας
 * ‘φιλτράρει’ κάθε εξάδα ώστε να πληροί τα παρακάτω κριτήρια:
 * 1) Να περιέχει το πολύ 4 άρτιους,
 * 2) να περιέχει το πολύ 4 περιττούς,
 * 3) να περιέχει το πολύ 2 συνεχόμενους,
 * 4) να περιέχει το πολύ 3 ίδιους λήγοντες,
 * 5) να περιέχει το πολύ 3 αριθμούς στην ίδια δεκάδα.
 * <p>
 * Τέλος, εκτυπώνει τις τελικές εξάδες σε ένα αρχείο με όνομα της επιλογής σας και κατάληξη.txt.
 */
public class Project1 {

    public static void main(String[] args) {

    }
}
